app/Controllers/Auth/Users.php

    public function processLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validasi input
        $validationRules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Lakukan validasi dan autentikasi pengguna
        $user = $this->employeeModel->where('username', $username)->first();
---
SELECT *
FROM `employees`
WHERE `username` = 'admin'
 LIMIT 1