app/Controllers/Admin/EmployeeController.php

    public function index()
    {
        $data['employee'] = $this->employeeModel->findAll();
---
SELECT *
FROM `employees`