app/Controllers/Admin/OrganizationController.php

SELECT *
FROM `organizations`
---
    public function index()
    {
        $data['organization'] = $this->organizationModel->findAll();