app/Controllers/TicketChatsController.php

INSERT INTO `ticket_chats` (`ticket_id`, `sender_id`, `message`, `created_at`, `updated_at`) VALUES ('4', '202312302301', 'Ini testing', '2023-06-07 01:15:30', '2023-06-07 01:15:30')
---
    public function create()
    {
        $dataObject = new ArrayObject($this->request->getPost());
        $data = $dataObject->getArrayCopy();

        $this->ticketChatModel->insert($data);