app/Controllers/TicketsController.php

    public function index()
    {
        $data['tickets'] = $this->ticketModel->findAll();
---
SELECT *
FROM `tickets`