app/Models/EmployeeModel.php

    public function countAll()
    {
        $builder = $this->db->table('employees');
        return $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `employees`