app/Models/OrganizationModel.php

SELECT COUNT(*) AS `numrows` FROM `organizations`
---
    public function countAll()
    {
        $builder = $this->db->table('organizations');
        return $builder->countAll();