app/Models/TicketModel.php

SELECT COUNT(*) AS `numrows` FROM `tickets`
---
    public function countAll()
    {
        $builder = $this->db->table('tickets');
        return $builder->countAll();

SELECT *
FROM `tickets`
LEFT JOIN `employees` ON `employees`.`nip` = `tickets`.`creator`
LEFT JOIN `organizations` ON `organizations`.`id` = `tickets`.`organization_id`
---
    public function getEmployee()
    {
        $builder = $this->db->table('tickets');
        $builder->join('employees', 'employees.nip = tickets.creator');
        $query = $builder->get();

SELECT *
FROM `tickets`
JOIN `employees` ON `employees`.`nip` = `tickets`.`creator`
WHERE `id` = '4'
---
    public function getTicketBy($id)
    {
        $builder = $this->db->table('tickets');
        $builder->join('employees', 'employees.nip = tickets.creator');
        $query = $builder->getWhere(['id' => $id]);