app/Models/TicketModel.php

    public function getTicketBy($id)
    {
        $query = $this->db->table('tickets')
            ->join('employees', 'employees.nip = tickets.creator')
            ->join('organizations', 'organizations.id = tickets.organization_id')
            ->where('tickets.ticket_id', $id)
            ->get();
---
SELECT *
FROM `tickets`
JOIN `employees` ON `employees`.`nip` = `tickets`.`creator`
JOIN `organizations` ON `organizations`.`id` = `tickets`.`organization_id`
WHERE `tickets`.`ticket_id` = '1'