app/Models/TicketChatModel.php

SELECT *
FROM `ticket_chats`
LEFT JOIN `tickets` ON `ticket_chats`.`ticket_id` = `tickets`.`ticket_id`
LEFT JOIN `employees` ON `ticket_chats`.`sender_id` = `employees`.`nip`
WHERE `ticket_chats`.`ticket_id` = '1'
---
    public function ticket($id)
    {
        $builder = $this->db->table('ticket_chats');
        $builder->join('tickets', 'ticket_chats.ticket_id = tickets.id', 'left');
        $builder->join('employees', 'ticket_chats.sender_id = employees.nip', 'left');
        $builder->where('ticket_chats.ticket_id', $id);
        // $query = $builder->getWhere(['ticket_chats.ticket_id' => $id]);
        $query = $builder->get();